{"_id": "q00001", "title": "", "text": "What are the service and product offerings from Microsoft\n\nWhat are the service and product offerings provided by Microsoft?"}
{"_id": "q00002", "title": "", "text": "MSFT segment breakdown\n\nParaphrased Query: Provide a segment breakdown for MSFT."}
{"_id": "q00003", "title": "", "text": "Who are Microsoft`s key customers?\n\nWho are the key customers of Microsoft?"}
{"_id": "q00004", "title": "", "text": "What is Microsoft`s business model\n\nWhat is Microsoft's business model?"}
{"_id": "q00005", "title": "", "text": "MSFT Capex commitment\n\nParaphrased Query: What is Microsoft's capital expenditure commitment?"}
{"_id": "q00006", "title": "", "text": "Which recent M&A activities has Microsoft been involved in\n\nWhich recent mergers and acquisitions has Microsoft participated in?"}
{"_id": "q00007", "title": "", "text": "How much revenue does Microsoft generate from contracts with customers?\n\nWhat is the revenue generated by Microsoft from customer contracts?"}
{"_id": "q00008", "title": "", "text": "MSFT remaining performance obligation\n\nParaphrased Query: What is the remaining performance obligation for MSFT?"}
{"_id": "q00009", "title": "", "text": "Adobe subsidiaries of trademarks\n\nParaphrased Query: What are the trademarks associated with Adobe subsidiaries?"}
{"_id": "q00010", "title": "", "text": "ADBE share repurchase\n\nParaphrased Query: Provide details on the ADBE share repurchase."}
{"_id": "q00011", "title": "", "text": "fully diluted shares outstanding ADBE\n\nWhat are the fully diluted shares outstanding for ADBE?"}
{"_id": "q00012", "title": "", "text": "Who are the members of Adobe`s management team\n\nWho comprises Adobe's management team?"}
{"_id": "q00013", "title": "", "text": "ADBE RPO\n\nParaphrased Query: What is the revenue from remaining performance obligations (RPO) for Adobe (ADBE)?"}
{"_id": "q00014", "title": "", "text": "ADBE KPI\n\nParaphrased Query: Provide the key performance indicators for ADBE."}
{"_id": "q00015", "title": "", "text": "How are Coupang`s KPIs?\"\n\nWhat are Coupang's key performance indicators (KPIs)?"}
{"_id": "q00016", "title": "", "text": "Coupang segment margin\n\nParaphrased Query: What is the segment margin for Coupang?"}
{"_id": "q00017", "title": "", "text": "CPNG capital expenditure\n\nParaphrased Query: What is the capital expenditure for CPNG?"}
{"_id": "q00018", "title": "", "text": "CPNG any recent M&A activities\n\nWhat recent M&A activities have occurred concerning CPNG?"}
{"_id": "q00019", "title": "", "text": "When did Coupang`s Farfetch consolidation start\n\nWhen did the consolidation of Farfetch by Coupang commence?"}
{"_id": "q00020", "title": "", "text": "What is FLC, and how is its revenue recognized by Coupang\n\nWhat is FLC, and how does Coupang recognize its revenue?"}
{"_id": "q00021", "title": "", "text": "When did new FLC contract begin CPNG\n\nWhen did the new FLC contract for CPNG commence?"}
{"_id": "q00022", "title": "", "text": "CPNG free cash flow\n\nWhat is the free cash flow for CPNG?"}
{"_id": "q00023", "title": "", "text": "Class of Shares CPNG\n\nParaphrased Query: What is the class of shares for CPNG?"}
{"_id": "q00024", "title": "", "text": "any highlights from Linde`s 2023 earnings result\n\nWhat are the highlights from Linde's earnings results for 2023?"}
{"_id": "q00025", "title": "", "text": "Linde Segment breakdown\n\nParaphrased Query: Provide a segment breakdown for Linde."}
{"_id": "q00026", "title": "", "text": "Linde Shareholder return\n\nParaphrased Query: What is the shareholder return for Linde?"}
{"_id": "q00027", "title": "", "text": "asset divestitures Linde\n\nParaphrased Query: Please provide details on asset divestitures for Linde."}
{"_id": "q00028", "title": "", "text": "What is the total number of leases held by Linde\n\nWhat is the total number of leases held by Linde?"}
{"_id": "q00029", "title": "", "text": "Linde Outstanding share\n\nParaphrased Query: What is the number of outstanding shares for Linde?"}
{"_id": "q00030", "title": "", "text": "the top 3 risks faced by Linde\n\nWhat are the top three risks encountered by Linde?"}
{"_id": "q00031", "title": "", "text": "Linde`s geographical coverage\n\nParaphrased Query: What is Linde's geographical coverage?"}
{"_id": "q00032", "title": "", "text": "Which items were taken into account to derive adjusted EBITDA compared to EBITDA for Linde\n\nWhat items were considered in calculating adjusted EBITDA in relation to EBITDA for Linde?"}
{"_id": "q00033", "title": "", "text": "one-off expenses of Linde occurred in 2023\n\nWhat were the one-off expenses incurred by Linde in 2023?"}
{"_id": "q00034", "title": "", "text": "Why did Linde`s working capital increase\n\nWhat caused the increase in Linde's working capital?"}
{"_id": "q00035", "title": "", "text": "How much is available for Oracle stock repurchases\n\nWhat is the amount allocated for Oracle stock repurchases?"}
{"_id": "q00036", "title": "", "text": "Oracle`s equity investments\n\nParaphrased Query: What are Oracle's equity investments?"}
{"_id": "q00037", "title": "", "text": "ORCL M&A\n\nParaphrased Query: Provide information on ORCL's mergers and acquisitions."}
{"_id": "q00038", "title": "", "text": "Oracle`s contractual obligations\n\nParaphrased Query: What are Oracle's contractual obligations?"}
{"_id": "q00039", "title": "", "text": "Why did Oracle`s net cash used for investing activities change by over 80%\n\nWhat factors contributed to the over 80% change in Oracle's net cash used for investing activities?"}
{"_id": "q00040", "title": "", "text": "Which cost item represents the highest percentage of Oracle`s sales\n\nWhich cost item accounts for the highest percentage of Oracle's sales?"}
{"_id": "q00041", "title": "", "text": "ORCL segment breakdown\n\nParaphrased Query: Provide a segment breakdown for ORCL."}
{"_id": "q00042", "title": "", "text": "Updates on Oracle`s headcount\n\nParaphrased Query: What are the updates regarding Oracle's headcount?"}
{"_id": "q00043", "title": "", "text": "Oracle`s dividend payout\n\nParaphrased Query: What is Oracle's dividend payout?"}
{"_id": "q00044", "title": "", "text": "Any meaningful ramp to address AI capacity/datacenter constraints ORCL\n\nIs there a significant plan to address AI capacity and datacenter constraints for Oracle?"}
{"_id": "q00045", "title": "", "text": "Nvidia`s end market\n\nParaphrased Query: What are Nvidia's end markets?"}
{"_id": "q00046", "title": "", "text": "Nvidia 5yr cumulative total return\n\nWhat is the cumulative total return for Nvidia over the past five years?"}
{"_id": "q00047", "title": "", "text": "Percentage of total revenue accounted for by Nvidia`s largest customer\n\nWhat percentage of total revenue is accounted for by Nvidia's largest customer?"}
{"_id": "q00048", "title": "", "text": "Any other concentration risks observed from Nvidia`s financials?\n\nAre there any additional concentration risks identified in Nvidia's financials?"}
{"_id": "q00049", "title": "", "text": "What drove the improvement in the gross profit margin NVDA\n\nWhat factors contributed to the improvement in NVDA's gross profit margin?"}
{"_id": "q00050", "title": "", "text": "P&G business model\n\nParaphrased Query: What is the business model of P&G?"}
{"_id": "q00051", "title": "", "text": "What percentage of total revenue does the P&G`s largest customer account for\n\nWhat percentage of total revenue is accounted for by P&G's largest customer?"}
{"_id": "q00052", "title": "", "text": "Current number of employees at P&G and % yoy growth\n\nWhat is the current number of employees at P&G and the year-over-year growth percentage?"}
{"_id": "q00053", "title": "", "text": "How did war between Russia and Ukraine impact P&G business\n\nWhat was the impact of the Russia-Ukraine war on P&G's business?"}
{"_id": "q00054", "title": "", "text": "P&G cybersecurity related risks\n\nParaphrased Query: What are the cybersecurity-related risks associated with P&G?"}
{"_id": "q00055", "title": "", "text": "Who among the management had the longest tenure? P&G\n\nWhich member of P&G management has the longest tenure?"}
{"_id": "q00056", "title": "", "text": "P&G any updates on share repurchase plan?\n\nAre there any updates on P&G's share repurchase plan?"}
{"_id": "q00057", "title": "", "text": "How many consecutive years has P&G increased its dividend?\n\nHow many consecutive years has Procter & Gamble increased its dividend?"}
{"_id": "q00058", "title": "", "text": "By what percentage did the P&G`s dividend increase this year\n\nWhat was the percentage increase in P&G's dividend this year?"}
{"_id": "q00059", "title": "", "text": "P&G`s ticker\n\nParaphrased Query: What is the ticker symbol for P&G?"}
{"_id": "q00060", "title": "", "text": "P&G org structure overview\n\nParaphrased Query: Provide an overview of the organizational structure of P&G."}
{"_id": "q00061", "title": "", "text": "How many product categories does P&G have\n\nWhat is the number of product categories offered by P&G?"}
{"_id": "q00062", "title": "", "text": "What are the major brands for Fem care in P&G\n\nWhat are the primary brands for Fem Care within P&G?"}
{"_id": "q00063", "title": "", "text": "Strategic direction of P&G\n\nParaphrased Query: What is the strategic direction of Procter & Gamble?"}
{"_id": "q00064", "title": "", "text": "Why did net earnings decrease despite increase of sales/OP P&G\n\nWhat factors contributed to the decrease in net earnings despite the increase in sales for P&G?"}
{"_id": "q00065", "title": "", "text": "P&G What does the ratio of adjusted free cash flow to net earnings imply?\n\nWhat does the ratio of adjusted free cash flow to net earnings indicate for P&G?"}
{"_id": "q00066", "title": "", "text": "Which factor contributed more significantly to the gross margin improvement of P&G: price increases or quantity increases?\n\nWhich factor had a greater impact on the gross margin improvement of P&G: price increases or quantity increases?"}
{"_id": "q00067", "title": "", "text": "Capex during the fiscal year ended in Jun 2023 and where it was spent P&G\n\nWhat was the capital expenditure for Procter & Gamble during the fiscal year ended June 2023, and how was it allocated?"}
{"_id": "q00068", "title": "", "text": "Did P&G acquire any businesses in 2023?\n\nDid P&G make any business acquisitions in 2023?"}
{"_id": "q00069", "title": "", "text": "Did P&G raise any debts during the fiscal year ended in Jun 2023\n\nDid P&G incur any debt during the fiscal year ending June 2023?"}
{"_id": "q00070", "title": "", "text": "What is the total amount of cash and cash equivalents Procter & Gamble (P&G) has as of the fiscal year ended in Jun 2023\n\nWhat was the total amount of cash and cash equivalents held by Procter & Gamble (P&G) as of the fiscal year ended June 2023?"}
{"_id": "q00071", "title": "", "text": "P&G`s credit rating?\n\nWhat is P&G's credit rating?"}
{"_id": "q00072", "title": "", "text": "What was the yoy organic growth % of Beauty segment of P&G\n\nWhat was the year-over-year organic growth percentage of the Beauty segment of P&G?"}
{"_id": "q00073", "title": "", "text": "What is a measure for P&G to determine dividends, share repurchases, acquisitions and other discretionary investments\n\nWhat measure does P&G use to assess dividends, share repurchases, acquisitions, and other discretionary investments?"}
{"_id": "q00074", "title": "", "text": "How many fleet does DAL own\n\nWhat is the total number of fleets owned by DAL?"}
{"_id": "q00075", "title": "", "text": "Ratio of owned: finance lease: operating lease based on operating aircraft fleet DAL\n\nWhat is the ratio of owned, finance lease, and operating lease for the operating aircraft fleet of DAL?"}
{"_id": "q00076", "title": "", "text": "What percentage of Endeavor`s shares does Delta own?\n\nWhat percentage of Endeavor's shares is owned by Delta?"}
{"_id": "q00077", "title": "", "text": "When is the scheduled delivery date for the DAL A350?\n\nWhat is the scheduled delivery date for the DAL A350?"}
{"_id": "q00078", "title": "", "text": "Which region showed highest % growth of delta in passenger revenue? And what was the main driver?\n\nWhich region exhibited the highest percentage growth in delta passenger revenue, and what was the primary driver?"}
{"_id": "q00079", "title": "", "text": "Any updates on DAL and AMEX partnership\n\nAre there any updates regarding the partnership between DAL and AMEX?"}
{"_id": "q00080", "title": "", "text": "Which operating expense represents the highest percentage of DAL`s sales\n\nWhich operating expense constitutes the highest percentage of DAL's sales?"}
{"_id": "q00081", "title": "", "text": "How did the fuel price impact the 2023 financials of delta air lines\n\nWhat was the impact of fuel prices on Delta Air Lines' financials in 2023?"}
{"_id": "q00082", "title": "", "text": "DAL Capex during the fiscal year ended in Jun 2023 and where it was spent\n\nWhat was DAL's capital expenditure for the fiscal year ending June 2023, and how was it allocated?"}
{"_id": "q00083", "title": "", "text": "DAL 2024 Capex guidance\n\nParaphrased Query: What is the capital expenditure guidance for DAL in 2024?"}
{"_id": "q00084", "title": "", "text": "What is the estimated cost for the New York-LaGuardia Redevelopment DAL\n\nWhat is the estimated cost for the redevelopment of New York-LaGuardia Airport?"}
{"_id": "q00085", "title": "", "text": "When did DAL`s quarterly dividend start all over again?\n\nWhen did DAL's quarterly dividend resume?"}
{"_id": "q00086", "title": "", "text": "How much was the delta s aggregate current and noncurrent loyalty program deferred revenue balance as of FY 2023\n\nWhat was the aggregate current and noncurrent loyalty program deferred revenue balance for Delta as of FY 2023?"}
{"_id": "q00087", "title": "", "text": "What is the useful life for aircraft DAL\n\nWhat is the useful life of aircraft DAL?"}
{"_id": "q00088", "title": "", "text": "Where does DAL recognize advertising costs\n\nWhere does DAL record advertising costs?"}
{"_id": "q00089", "title": "", "text": "How many vehicles did TSLA deliver in 2023?\n\nWhat was the number of vehicles delivered by TSLA in 2023?"}
{"_id": "q00090", "title": "", "text": "Were there any one-off items reported in tesla 2023?\n\nWere there any one-time items reported for Tesla in 2023?"}
{"_id": "q00091", "title": "", "text": "Capex in 2023 tsla\n\nWhat is the capital expenditure for Tesla in 2023?"}
{"_id": "q00092", "title": "", "text": "TSLA Capex guidance in 2024\n\nWhat is the capital expenditure guidance for TSLA in 2024?"}
{"_id": "q00093", "title": "", "text": "Where does TSLA produce its Cybertruck\n\nWhere is the production location for TSLA's Cybertruck?"}
{"_id": "q00094", "title": "", "text": "TSLA Inventory breakdown as of 2023\n\nParaphrased Query: Provide an inventory breakdown for TSLA as of 2023."}
{"_id": "q00095", "title": "", "text": "Any recent litigation cases tesla\n\nAre there any recent litigation cases involving Tesla?"}
{"_id": "q00096", "title": "", "text": "TSLA three-year historical depreciation expense\n\nWhat is the three-year historical depreciation expense for TSLA?"}
{"_id": "q00097", "title": "", "text": "How many outstanding shares TSLA\n\nWhat is the number of outstanding shares for TSLA?"}
{"_id": "q00098", "title": "", "text": "What is TSLA`s mission?\n\nWhat is Tesla's mission?"}
{"_id": "q00099", "title": "", "text": "Netflix Paid membership updates\n\nParaphrased Query: Provide updates on Netflix paid memberships."}
{"_id": "q00100", "title": "", "text": "Does Netflix still offer DVD-by-mail service\n\nDoes Netflix continue to provide a DVD-by-mail service?"}
{"_id": "q00101", "title": "", "text": "Netflix Business model\n\nParaphrased Query: What is the business model of Netflix?"}
{"_id": "q00102", "title": "", "text": "Netflix Any updates on total amount of content obligations\n\nAre there any updates regarding the total amount of content obligations for Netflix?"}
{"_id": "q00103", "title": "", "text": "Content obligations in next 12 months Netflix\n\nWhat are the content obligations for Netflix in the next 12 months?"}
{"_id": "q00104", "title": "", "text": "NFLX 3 year historical advertising cost trend\n\nWhat is the three-year historical trend of advertising costs for NFLX?"}
{"_id": "q00105", "title": "", "text": "3 year streaming revenue trend of netflix\n\nWhat is the three-year trend of streaming revenue for Netflix?"}
{"_id": "q00106", "title": "", "text": "What drove OP margin improvement NFLX\n\nWhat factors contributed to the improvement of OP margin for NFLX?"}
{"_id": "q00107", "title": "", "text": "Which region showed the highest increase in paid net membership additions of netflix\n\nWhich region experienced the highest growth in paid net membership additions for Netflix?"}
{"_id": "q00108", "title": "", "text": "NFLX Any updates on share repurchase\n\nAre there any updates regarding the share repurchase for NFLX?"}
{"_id": "q00109", "title": "", "text": "Customer group that Home depot serve\n\nWhat customer group does Home Depot serve?"}
{"_id": "q00110", "title": "", "text": "Home Depot # of employee\n\nWhat is the number of employees at Home Depot?"}
{"_id": "q00111", "title": "", "text": "Home Depot retail strategy\n\nParaphrased Query: What is the retail strategy of Home Depot?"}
{"_id": "q00112", "title": "", "text": "HD How many acquisitions happened in 2023?\n\nHow many acquisitions occurred in 2023 for HD?"}
{"_id": "q00113", "title": "", "text": "Total amount of shareholder return in 2023 Home Depot\n\nWhat is the total amount of shareholder return for Home Depot in 2023?"}
{"_id": "q00114", "title": "", "text": "Any reasons for Capex growth of HD\n\nWhat are the reasons for the growth in Capex for HD?"}
{"_id": "q00115", "title": "", "text": "Home Depot why did net sales decrease in 2023?\n\nWhat were the reasons for the decrease in net sales for Home Depot in 2023?"}
{"_id": "q00116", "title": "", "text": "Updates on inventory level Home Depot\n\nWhat are the current updates on Home Depot's inventory levels?"}
{"_id": "q00117", "title": "", "text": "Net advertising expense over the past three years on an annual basis Home Depot\n\nWhat has been Home Depot's annual net advertising expense over the past three years?"}
{"_id": "q00118", "title": "", "text": "HD Net PP&E as of 2023\n\nWhat is the HD Net PP&E as of 2023?"}
{"_id": "q00119", "title": "", "text": "Company fiscal year appl\n\nParaphrased Query: What is the fiscal year of the company?"}
{"_id": "q00120", "title": "", "text": "When will apple Vision Pro launch?\n\nWhen is the anticipated launch date for Apple Vision Pro?"}
{"_id": "q00121", "title": "", "text": "Depreciation expense on PP&E over the past three years on an annual basis apple\n\nWhat has been the annual depreciation expense on PP&E over the past three years?"}
{"_id": "q00122", "title": "", "text": "Update on share repurchase of apple\n\nUpdate on Apple's share repurchase program."}
{"_id": "q00123", "title": "", "text": "Which region contributes the most to the revenue of APPL?\n\nWhich region is the largest contributor to APPL's revenue?"}
{"_id": "q00124", "title": "", "text": "APPL new product launch in 4Q23\n\nParaphrased Query: What is the status of Apple's new product launch in the fourth quarter of 2023?"}
{"_id": "q00125", "title": "", "text": "SG&A % of rev in 2023 appl\n\nWhat is the SG&A percentage of revenue for 2023?"}
{"_id": "q00126", "title": "", "text": "Appl additional leases occurred in later part of 2023\n\nParaphrased Query: Did additional leases for Apple occur in the latter part of 2023?"}
{"_id": "q00127", "title": "", "text": "When was the most recent employee stock plan that apple announced?\n\nWhen did Apple announce its most recent employee stock plan?"}
{"_id": "q00128", "title": "", "text": "Appl depreciation expense over the past three years on an annual basis\n\nWhat has been the annual depreciation expense for Apple over the past three years?"}
{"_id": "q00129", "title": "", "text": "Amazon AWS yoy growth in constant cuurency\n\nWhat is the year-over-year growth of Amazon AWS in constant currency?"}
{"_id": "q00130", "title": "", "text": "Amazon 1Q24 guidance\n\nParaphrased Query: What is the guidance for Amazon in the first quarter of 2024?"}
{"_id": "q00131", "title": "", "text": "AMZN what are the components of fulfillment costs?\n\nWhat are the components of fulfillment costs for AMZN?"}
{"_id": "q00132", "title": "", "text": "2023 inventory valuation allowance of AMZN\n\nWhat is the inventory valuation allowance for AMZN in 2023?"}
{"_id": "q00133", "title": "", "text": "Total PP&E of AMZN in 2023\n\nWhat is the total property, plant, and equipment (PP&E) of AMZN in 2023?"}
{"_id": "q00134", "title": "", "text": "Any updates on Amazon Prime Video\n\nAre there any updates regarding Amazon Prime Video?"}
{"_id": "q00135", "title": "", "text": "Were there any share repurchases in 2023 Amazon?\n\nWere there any share repurchases by Amazon in 2023?"}
{"_id": "q00136", "title": "", "text": "AMZN SBC expense occurred in 2023\n\nWhat was the SBC expense for AMZN in 2023?"}
{"_id": "q00137", "title": "", "text": "Amazon revenue sources\n\nParaphrased Query: Identify the revenue sources for Amazon."}
{"_id": "q00138", "title": "", "text": "Any comments on tech investment of amazon\n\nWhat are the comments regarding Amazon's technology investments?"}
{"_id": "q00139", "title": "", "text": "Amazon Par value\n\nParaphrased Query: What is the par value of Amazon?"}
{"_id": "q00140", "title": "", "text": "Potential/current competitors of amazon?\n\nWho are the potential and current competitors of Amazon?"}
{"_id": "q00141", "title": "", "text": "When was Amazon established?\n\nWhen was Amazon founded?"}
{"_id": "q00142", "title": "", "text": "What is the total square footage of Amazon`s international fulfillment centers, data centers, and other facilities?\n\nWhat is the total square footage of Amazon's international fulfillment centers, data centers, and other facilities?"}
{"_id": "q00143", "title": "", "text": "Revenue recognition methodology of amazon from 3rd party seller\n\nWhat is the revenue recognition methodology for Amazon concerning third-party sellers?"}
{"_id": "q00144", "title": "", "text": "When did 20:1 stock split happen in AMZN\n\nWhen did the 20:1 stock split occur for AMZN?"}
{"_id": "q00145", "title": "", "text": "Describe how AWS generate revenue\n\nParaphrased Query: Explain how AWS generates revenue."}
{"_id": "q00146", "title": "", "text": "Amazon Acquisitions in 2023?\n\nWhat acquisitions did Amazon make in 2023?"}
{"_id": "q00147", "title": "", "text": "When was the current share repurchase program announced in AMZN?\n\nWhen was the current share repurchase program for AMZN announced?"}
{"_id": "q00148", "title": "", "text": "Amazon inventory management strategy\n\nParaphrased Query: What is Amazon's inventory management strategy?"}
{"_id": "q00150", "title": "", "text": "Why does Meta use family metrics?\n\nWhat is the rationale behind Meta's use of family metrics?"}
{"_id": "q00151", "title": "", "text": "META Family DAP and MAP calculation methodology?\n\nWhat is the calculation methodology for META Family DAP and MAP?"}
{"_id": "q00152", "title": "", "text": "Any upddates on Reality Labs Meta\n\nAre there any updates regarding Reality Labs at Meta?"}
{"_id": "q00153", "title": "", "text": "Key investment areas in 2024 Meta\n\nWhat are the key investment areas for Meta in 2024?"}
{"_id": "q00154", "title": "", "text": "Mgmt view on Meta competitive landscape\n\nParaphrased Query: Management's perspective on the competitive landscape of Meta."}
{"_id": "q00155", "title": "", "text": "Meta % yoy growth of FoA revenue\n\nWhat is the year-over-year percentage growth of Meta's FoA revenue?"}
{"_id": "q00156", "title": "", "text": "Meta what is management`s outlook on the future drivers of ad revenue?\n\nWhat is management's outlook on the future drivers of advertising revenue for Meta?"}
{"_id": "q00157", "title": "", "text": "Has the sales volume of Meta Quest increased or decreased?\n\nHas the sales volume of Meta Quest changed?"}
{"_id": "q00158", "title": "", "text": "Any divestures in 2023 Meta\n\nWere there any divestitures by Meta in 2023?"}
{"_id": "q00159", "title": "", "text": "Total number of employees of JnJ\n\nWhat is the total number of employees at Johnson & Johnson?"}
{"_id": "q00160", "title": "", "text": "Gross amounts of patents and trademarks as of 2023 JnJ\n\nWhat are the gross amounts of patents and trademarks for JnJ as of 2023?"}
{"_id": "q00161", "title": "", "text": "What has been DPS over the past 3 years JnJ\n\nWhat has been the dividend per share (DPS) for Johnson & Johnson over the past three years?"}
{"_id": "q00162", "title": "", "text": "JnJ Diluted Adj. avg. shares outstanding as of 2023 (include the unit as well)\n\nWhat are the diluted adjusted average shares outstanding for JnJ as of 2023, including the unit?"}
{"_id": "q00163", "title": "", "text": "Best selling drug in 2023 of Johnson & Johnson\n\nWhat was the best-selling drug of Johnson & Johnson in 2023?"}
{"_id": "q00164", "title": "", "text": "Johnson & Johnson Investment in 2023\n\nParaphrased Query: What was Johnson & Johnson's investment in 2023?"}
{"_id": "q00165", "title": "", "text": "JnJ Mgmt overview\n\nParaphrased Query: Provide an overview of Johnson & Johnson management."}
{"_id": "q00166", "title": "", "text": "How much $ invested in JnJ R&D as of 2023\n\nWhat is the amount invested in Johnson & Johnson's R&D as of 2023?"}
{"_id": "q00167", "title": "", "text": "Any advancements for its Innovative Medicine pipeline JnJ\n\nWhat are the advancements in Johnson & Johnson's Innovative Medicine pipeline?"}
{"_id": "q00168", "title": "", "text": "JnJ R&D expense % of revenue in 2023\n\nWhat is the percentage of JnJ's R&D expenses relative to revenue in 2023?"}
{"_id": "q00169", "title": "", "text": "ROE and ROTCE as of 2023 JP Morgan\n\nROE and ROTCE for JP Morgan as of 2023."}
{"_id": "q00170", "title": "", "text": "Credit provided for consumers as of 2023 JP Morgan\n\nCredit extended to consumers by JP Morgan as of 2023."}
{"_id": "q00171", "title": "", "text": "JP Morgan markets revenue consist of what\n\nWhat does JP Morgan's markets revenue consist of?"}
{"_id": "q00172", "title": "", "text": "What are the components of principal transactions of JPM\n\nWhat are the components of principal transactions for JPM?"}
{"_id": "q00173", "title": "", "text": "JPM Acquisition in 2023\n\nParaphrased Query: What is the status of JPM's acquisition in 2023?"}
{"_id": "q00174", "title": "", "text": "Competitors of JPM\n\nParaphrased Query: Who are the competitors of JPM?"}
{"_id": "q00175", "title": "", "text": "Employee net addition in 2023 JPM\n\nWhat is the net addition of employees for JPM in 2023?"}
{"_id": "q00176", "title": "", "text": "Why did LT debt increase in 2023 JP Morgan\n\nWhat caused the increase in long-term debt for JP Morgan in 2023?"}
{"_id": "q00177", "title": "", "text": "JPM What drove strong performance of equity underwriting\n\nWhat factors contributed to the strong performance of equity underwriting at JPM?"}
{"_id": "q00178", "title": "", "text": "JP Morgan Segment breakdown\n\nParaphrased Query: Please provide a breakdown of segments for JP Morgan."}
{"_id": "q00180", "title": "", "text": "Visa Company overview\n\nParaphrased Query: Provide an overview of Visa Company."}
{"_id": "q00181", "title": "", "text": "How does VISA earn money\n\nHow does VISA generate revenue?"}
{"_id": "q00182", "title": "", "text": "VISA Acquisition in 2023\n\nVISA Acquisition details for 2023."}
{"_id": "q00183", "title": "", "text": "Who are VISA`s electronic payment competitors\n\nWho are the competitors of VISA in the electronic payment sector?"}
{"_id": "q00184", "title": "", "text": "How geopolitical factors can impact the VISA business\n\nHow can geopolitical factors impact the VISA business?"}
{"_id": "q00185", "title": "", "text": "Why did labor cost increase 17% yoy Visa\n\nWhat were the reasons for the 17% year-over-year increase in labor costs for Visa?"}
{"_id": "q00186", "title": "", "text": "What has been the total amount of processed transactions by Visa over the past 3 years, measured in billions?\n\nWhat is the total value of processed transactions by Visa over the past three years, expressed in billions?"}
{"_id": "q00187", "title": "", "text": "Visa 2023 earning\n\nParaphrased Query: What are the earnings for Visa in 2023?"}
{"_id": "q00188", "title": "", "text": "VISA Fintech related commentary\n\nParaphrased Query: Provide commentary related to VISA's fintech initiatives."}
{"_id": "q00189", "title": "", "text": "UnitedHealth Group Segment breakdown\n\nProvide a segment breakdown for UnitedHealth Group."}
{"_id": "q00190", "title": "", "text": "UnitedHealth Group What drove revenue increase in 2023\n\nWhat factors contributed to the revenue increase for UnitedHealth Group in 2023?"}
{"_id": "q00191", "title": "", "text": "Company level OP margin in 2023 unitedhealth\n\nWhat is the operating profit margin for UnitedHealth at the company level in 2023?"}
{"_id": "q00192", "title": "", "text": "UNH ROE as of 2023\n\nWhat is the return on equity (ROE) for UNH as of 2023?"}
{"_id": "q00193", "title": "", "text": "UNH Impact of cyber attack\n\nParaphrased Query: What is the impact of the cyber attack on UNH?"}
{"_id": "q00194", "title": "", "text": "Medical care ratio of UnitedHealth Group as of 2023\n\nWhat is the medical care ratio for UnitedHealth Group as of 2023?"}
{"_id": "q00195", "title": "", "text": "Any updates on Brazil biz disposition of UnitedHealth Group\n\nAre there any updates regarding the disposition of UnitedHealth Group's business in Brazil?"}
{"_id": "q00196", "title": "", "text": "What is management`s outlook of UnitedHealth Group on medical cost trends for 2024?\n\nWhat is management's outlook for UnitedHealth Group regarding medical cost trends in 2024?"}
{"_id": "q00197", "title": "", "text": "What factors contributed to the significant increase in revenue of UNH?\n\nWhat factors led to the substantial increase in revenue for UNH?"}
{"_id": "q00198", "title": "", "text": "Dividend paid in 2023 UnitedHealth\n\nWhat was the dividend paid by UnitedHealth in 2023?"}
{"_id": "q00199", "title": "", "text": "What is Alphabet`s stance on AI?\n\nWhat is Alphabet's position on AI?"}
{"_id": "q00200", "title": "", "text": "Primary revenue source of Google Services\n\nParaphrased Query: What is the primary revenue source of Google Services?"}
{"_id": "q00201", "title": "", "text": "What potential threats to Google Search has the management identified?\n\nWhat potential threats to Google Search have been identified by management?"}
{"_id": "q00202", "title": "", "text": "Why did Alphabet Opex increase in 2023 vs. previous year\n\nWhat were the reasons for the increase in Alphabet's operating expenses in 2023 compared to the previous year?"}
{"_id": "q00203", "title": "", "text": "Alphabet When was the offer letter issued to Ruth Porat?\n\nWhen was the offer letter issued to Ruth Porat by Alphabet?"}
{"_id": "q00204", "title": "", "text": "Capex guidance Alphabet\n\nParaphrased Query: What is the capital expenditure guidance for Alphabet?"}
{"_id": "q00205", "title": "", "text": "How is subscription revenue (e.g., YouTube premium) recognized\n\nHow is subscription revenue, such as YouTube Premium, recognized?"}
{"_id": "q00206", "title": "", "text": "Alphabet What has been the trend in Advertising and Promotional Expenses over the past three years?\n\nWhat has been the trend in Advertising and Promotional Expenses for Alphabet over the past three years?"}
{"_id": "q00207", "title": "", "text": "Google Cloud RPO as of 2023 (approximate # is fine)\n\nParaphrased Query: What is the approximate RPO for Google Cloud as of 2023?"}
{"_id": "q00208", "title": "", "text": "How might changes to advertising policies and data privacy practices impact Alphabet`s ads biz\n\nHow could alterations to advertising policies and data privacy practices affect Alphabet's advertising business?"}
{"_id": "q00209", "title": "", "text": "BNSF railroad freight volume\n\nParaphrased Query: What is the freight volume for BNSF Railway?"}
{"_id": "q00210", "title": "", "text": "Who runs berkshire\n\nWho is responsible for managing Berkshire Hathaway?"}
{"_id": "q00211", "title": "", "text": "What is management`s perspective on the insurance business Berkshire Hathaway\n\nWhat is management's view on the insurance sector of Berkshire Hathaway?"}
{"_id": "q00212", "title": "", "text": "How is Berkshire Hathaway`s business segmented into its major divisions or operating units\n\nHow is Berkshire Hathaway's business organized into its primary divisions or operating units?"}
{"_id": "q00213", "title": "", "text": "When will Berkshire repurchase common stock?\n\nWhen is Berkshire expected to repurchase common stock?"}
{"_id": "q00214", "title": "", "text": "How many distinct insurance underwriting groups are there within Berkshire\n\nWhat is the number of distinct insurance underwriting groups within Berkshire?"}
{"_id": "q00215", "title": "", "text": "What is the ticker symbol for Berkshire Hathaway`s Class B shares?\n\nWhat is the ticker symbol for Berkshire Hathaway Class B shares?"}
{"_id": "q00216", "title": "", "text": "What is the largest operating segment of the Berkshire Hathaway in terms of % of total revenue, as of 2023\n\nWhat is the largest operating segment of Berkshire Hathaway by percentage of total revenue as of 2023?"}
{"_id": "q00217", "title": "", "text": "Source of invested assets of insurance business BRK.A\n\nWhat is the source of the invested assets for the insurance business of BRK.A?"}
{"_id": "q00218", "title": "", "text": "Float as of 2023 BRK\n\nFloat for BRK as of 2023."}
